[
   {
      "selftext": "This is my first time here though I should have come a long time ago. This will be a long post with a lot of backstory so I apologize in advance. My mom and I were extremely close growing up and she was nothing but loving and supportive to me. Two years ago, things took a turn for the worst. I wasn't aware until recently, but apparently she has been addicted to pain meds for pretty much my entire life- she sustained a near-death accident when she was 18, and has had numerous surgeries since then. As such, she was always heavily prescribed meds and became addicted. My dad and her would fight about this frequently (never to my knowledge, I rarely if ever saw them actually have any serious verbal fight, and they have certainly NEVER had any physical fight). Anyways, my moms doctors stopped prescribing her pain meds at some point along the line- and she switched to alcohol. She never drank heavily but definitely always liked beer and would drink more than most other parents- but never liquor. She switched to liquor and began drinking in private, hiding bottles in our house, etc. It got very bad very quickly, but we (my dad, brother, and I) had no idea as we had never encountered real alcoholism. She passed out on the floor when my girlfriend (now-fiancee) came over for dinner one day. This was the first sign of a real problem. This was on a Sunday, and I was so embarassed that I left the house (I was living at home at the time). I went to work the next day, and came home and went straight to my room. My mom came home from work and wanted to talk acting like nothing was wrong. I was still furious with her and said \"I'm not talking to you until you apologzie for embarassing me and until we sit down and have a talk with Dad.\" She tries to change the subject and I ignore her. She sulks upstairs (drunkenly, though I didn't admit it/notice at the time). About 30 minutes late y dad rushes into my room asking what the fuck happened to my mother. Apparently, he came home to her sitting on our staircase, swaying violently, blind stupid drunk, drinking a 750mL Tito's bottle straight. She was crying and babbling about nothing and he put her in bed upstairs. She threw up violently and was just losing it. I'll never forget walking up those stairs to see her- the stairs she carried me up when I had a broken foot when I was younger. The stairs she chased me up when we were playing. The stairs she cried when she watched me walking down them for my first date/prom/graduation/moving out for college. The stairs that held so many fond memories were now a staircase to a hellish nightmare. I traversed the dark stairs, hearing her wails and sickness with each step. As I turned into her room, there was my mom, a soulless husk of the grand woman I have so much love and respect for. In short, she said she wanted and needed help. We took her to the ER where she got some benzos and we came home. She began an outpatient detox because she couldn't miss work. Started therapy sessions and going to AA. Things were going great for awhile- she would talk about her sobriety and celebrate milestone days (1 week, 1 month, 2 months). But she slowly stopped attending AA (said she didn't like the old people and depressing nature of it), stopped celebrating milestones, etc. She relapsed. Not as bad this time, just beer, but still relapsed and we had to find out by finding the bottles. Rinse repeat the cycle- less emotional this time, more anger on my part but not outward, still very understanding. Same cycle, did a physician-appointed at-home detox of sorts with my dads unwavering help and support. Weened her down. Things went well for longer than before- about 6ish months. Fast forward to 2 weeks ago. I am engaged to be married (September 15th). My mom had talked about this moment my entire life and LOVES my fiancee. Wedding planning has been difficult though. My mom will get emotional about things, and even angry/lash out at me over small things (she is NOT an angry person, always the sweetest, gentlest woman I've ever known). I lose patience with her- she will get mad at me for not telling her about certain things with the wedding, though I have definitely already shared with her these things. She becomes more forgetful- I ignore the signs and grow disdain for her. I share less and less with her and go home less and less (maybe subconsciously I know she is drinking again, but can't handle the heartbreak of the lies and to see her in that state). My dad and brother (both at home) say nothing to me. Finally, I go home one night to discuss wedding stuff with my parents. My mom does not look well and is being very loud/animated. She says \"why haven't you shown me the wedding registry I haven't seen that\" when I had sent her the link mere days before. We go on and more of this continues, and my dad angrily yells at me at one point that \"this wedding is getting out of fucking hand\", which is bizarre because he has nothing to do with the wedding, the bride's family is handling it all as is tradition here in the States. Anyways, my mom is clearly very drunk, looking back, but I deny the signs and just think shes being stupid and head home early. Lying in bed, I can't shake the feeling of how \"off\" everything felt- I had dreaded goin home in the first place, and wanted to leave as soon as I got there. My house used to be a place of comfort- my friends would all come there and chat with my parents for hours. They'd come in times of happiness and sadness, because they loved my parents and parents were both so honest and welcoming and happy. We were never the richest and had financial problems, but our bond as a family was always strong. Lying in bed, I was overcome at how that feeling had gone completely to shit. I was overcome with how the happy memories of my mom were quickly fading and were being replaced with anger and resentment. My dad called the next day to apologize for his outburst. I said don't sweat it, hes stressed with work and whatnot, blah blah. But I gather up the courage to ask if mom is alright. Silence. He asks what I think. I say I think she's been acting increasingly irrationally, is forgetful, and that I think she's drinking again. He breaks down. She has been drinking liquor again at an increasingly alarming rate. In the morning, at work, on the way home in the car, and at home. Waking up in the night to drink. Lying to us. The car has damage from where she has hit curbs/backed up into things. She had made my dad and brother promise to not to me, as they are enablers and I am not. The last time this happened I had said if she drank again she would not be invited to my wedding (I realize this sort of ultimatum is probably not healthy but I honestly have no idea what the fuck I'm doing and am just lost and said what I fealt).They had got in a fight after I left because she was so happy I had come home to talk to them and said we had a great conversation- my dad said she had not pulled it off at all and he was embarrassed by her. My dad goes on and on about how she never wants to leave the house, and when they do she embarrasses him in front of their friends. He says \"I am fucking dying, son. I cannot keep doing this\". My dad has always been the light-hearted \"funny guy\" amongst our family and friends- to see him like this broke the little piece of my heart left that my mom hadn't already broken with her constant lies to my face about her problem. We talked for hours, I broke down in tears at my fiancees parents house. They now know her problem because I couldn't hide my emotions. Fast forward to today- my mom has underwent another successful \"weening\" detox and is 1 week sober (according to her and my dad). She is seeing her therapist again and, in my opinion, is sober and doing well. However, she is still hesitant to talk about alcoholism, and will not admit to friends that she has a problem. She also will not go to AA (she says its too depressing). I am extremely concerned with her having another relapse. I am concerned (selfishly) that my own mother will be too drunk at my wedding, and will embarrass me. I am concerned we won't have a mother-son dance. But most importantly, I'm just concerned for her. All my love for her is slowly leaving and getting placed with resentment- having her lie numerous times to my face to hide her drinking has ruined my trust with her. I question everything she tells me now, even in times of apparent well-being. What can I do? I have no friends who have been in a similar situation to seek guidance from. I just want my loving, sweet mother back, not this hellish shell of what she once was.", 
      "subreddit": "AlAnon", 
      "title": "My Wedding, my mother, and alcohol."
   }, 
   {
      "selftext": "I'm a 27 year old guy. I've been sober for a year and a half. I have a sponsor, I work the steps, etc.\n\nI am the only person in my family that has ever had substance abuse issues. My mom is a social worker, and she is really supportive about me being in AA, and she seems to understand what it's all about, and she thinks it's great.\n\nBut, anytime I bring up AA around my dad, he clearly feels awkward and always tries to change the subject. I think the words \"alcoholic\" and \"AA\" carry stigma in his mind, and I think it's hard for him to associate his son with these words. He's glad I'm not drinking anymore, but I think he doesn't fully understand what AA is about, and it seems like he doesn't want to think of his son as someone who can never drink again. He is a great guy, and he is usually a very understanding person, but I wish it was easier for me to talk to him casually about my recovery, without it feeling extremely uncomfortable. What can I do to help remove the stigma?", 
      "subreddit": "alcoholicsanonymous", 
      "title": "How do I talk to my dad about me being in recovery?"
   }, 
   {
      "selftext": "I share my story in the hopes it will give someone the hope and strength they need to have the same experience I had to recover from alcoholism.  \nI was a nervous kid with lots of anxieties and adhd. I was off the walls and my head would never stop talking to me, I always seemed to overthink stuff. I never really felt like I was part of the group, like I was always on the outside looking in, even though I had friends.  I was never comfortable in my own skin. When I found booze I knew I found what was missing, looking back I was instantly addicted. I loved it, it made me feel like I could be the person I thought I wanted to be. I turned my life over to booze at the age of 13. Everything came second to booze. I chose a career where I could drink everyday working night shift as a waiter in restaurants. I had a shit tonne of fun and I was right in the middle of the action, I had arrived, I felt not only a part of, but almost like a leader of the party crew we had. Little did I know alcohol is a progressive disease and always gets worse, never better. My grandpa always said do something you love for a career, well I loved booze so I became a bartender... Lol.. (probably not what he meant) I ended up getting into cocaine which led me to my first treatment center. Funny thing is I wanted to quit coke so I could keep drinking, I never wanted to quit drinking, how could I ever have fun again without booze, life would be boring and mundane.... Shit was I wrong. Left that treatment center to drink the first night out. Then I moved towns and cocaine wasn't easy to find. I would come home after work and drink a 26er (750ml) of vodka by myself, pass out and wake up and puke a little bit..... Amazingly I actually thought I was doing good because I wasn't doing coke. My alcoholism progressed and I discovered the morning drink which was the death of me. I would drink the morning drink, trigger my allergy and keep drinking. In the end, after 20 yrs of hardcore drinking I had progressed to drinking around the clock, 4 or 5 day blackouts and I kept ending up on the hospital for medical detox as I was scared I would get seizures and die... It happens!.. Another treatment center only to drink the first day I got out again. In and out of AA for years, coming back over 30 times!... I was a hopeless alcoholic. I did want to drink but I couldn't imagine a life without it. How would I have the confidence to pick up women? To hang out with friends and be funny and the life of the party? How would I live life? I always had alcohol as a crutch to get me through the hard stuff in life.... Finally my family didn't want to talk to me anymore, not cus I was a bad drunk but they just couldn't stand by and watch me die, or come get their baby from the hospital shaking and on deaths door.... Again and again..... Finally my last drunk was a 4 day blackout, I knew I was going to die a lonely painful alcoholic death. I know to the core of my being that no matter what I do, I can not stop myself from picking up that first drink! I stood at the turning point, I was either going to commit suicide or completely turn my life over to a God I don't even think exists. I said to myself well if there is a God, I'm going to find out.... I got on my knees and I prayed, not like before but I honestly meant it and was willing to believe (there's no atheists when the plane is going down) I prayed to \"God\" and said I don't care what you would have me be, I completely give myself to you. You can have all of me and I meant it. I felt a weird feeling, like a 100 pound weight was taken from my shoulders. I was sick of following all the opinions and advice in AA, there is so much conflicting advice it's brutal. I said this time, I am doing it exactly how the first 100 men and women did it, if it isn't in the big book, I'm not doing it, nothing more, nothing less. It really worked back then, not now with all the treatment center bullshit. I studied that book like my life depended on it. I got a sponsor, I made a daily plan. Wake up, pray, make bed, red daily reflections, go to moon meeting, go to gym, read big nook, then night meeting, pray and go to bed. I did a meeting or 2 a day for the first year. I did my steps in the first 3 weeks, which is exactly how they are supposed to be done. I did them right out of the big book with the help of the Joe and Charlie speaker tapes... They are so amazing. They explain the book better than I've ever heard, I finally understood what to do... Today I am 9 yrs sober and I still call Joe and Charlie my program sponsors. I completely gave myself to AA even though I didn't believe in God and I hated AA and all those \"religious people\" and lame losers.... I found an amazing life. I made friends. I got involved with young people groups and we would go to dances and roundups, and bowling and kareoke and camping etc etc, I was the life of the sober party! I felt comfortable in my own skin! With the help of AA and \"God\" I walked through all those fears and lived life on life's terms and I thrived! ...... I started sponsoring people and they started getting sober. I ran Joe and Charlie step groups and helped others through the steps. I had a home group that I contributed to and ran the newcomers meeting for them before the main meeting. Today my life is honestly beyond my wildest dreams. When I sobered up I just wanted a little apartment and that would be great. I went back to school multiple times for different things, I learned how to be a mechanic and fix up jetskis and motorbikes, something I always wanted. I worked on boats and got other professional designations through school. I got jobs in top management for hospitality. Today I run my own successful business. I am happily married and have a dog and young daughter that makes me happier than I ever imagined I could be. I have a bunch of jetskis, boat, motorbike, etc. I own my own house on a large property. My life is amazing and I owe it all to AA...... If it weren't for AA I would be dead. I was a hopeless alcohol doomed to an alcoholic death but I was plucked from my own insanity by a power greater than me and have recovered from that seemingly hopeless state of mind and body.......i truly hope you all find your way. When. I tried to sober up without AA, sobriety was always something to endure, or fight through, and was very painful, with AA it made it so sobriety was something to be celebrated and enjoyed...  Here's a link to those tapes, pm me you email address if you want the sheets they talk about..... \nhttp://silkworth.net/pages/freestuff.php", 
      "subreddit": "alcoholicsanonymous", 
      "title": "hope for the hopeless"
   }, 
   {
      "selftext": "Hey r/stopdrinking! I apologize ahead of time if this seems like some text vomit here...\n\nSo, I’m looking for some advice/input from all of you lovely people in regards to my situation.\n\nA little background here. I have been sober since 7/25/17 and have gotten sober through AA. Had a sponsor, followed directions as they were given, worked the 12 steps. After doing 90+ meetings in 90 days, I was going to 4-5 meetings a week.\n\nNow, life has picked up. I have a (non-alcoholic) partner, I graduate cosmetology school next month, I test for my cosmetology license and begin working full time in July... basically life is getting busy. I’m finding that as I approach a year of sobriety, I have become much less dependent on AA. I KNOW that I simply cannot drink because I can not control my drinking, drinking does not make bad situations good, or good situations better, yada yada. I have no desire to drink or fix my problems with drinking. I also see a therapist weekly where I discuss my addiction recovery. \n\nMy question to you all... I feel like I can only extend myself in so many directions. My sponsor has told me that if I cannot attend at least 3-4 meetings every week, that she will not sponsor me. Would taking a step back from the program (NOT my sobriety, just the program of AA) be a huge misstep? Have you been successful staying sober without a structured program such as AA? I would really appreciate any feedback or suggestions from all of you lovely people. \n\nThanks in advance! ", 
      "subreddit": "stopdrinking", 
      "title": "Taking a break from a structured recovery program?"
   }, 
   {
      "selftext": "I quit drinking 7 weeks ago. Didn’t really have any desire to drink for 6 weeks. (Did suffer the insomnia) thought I had made it to borderline and backed down. until I had a bad performance review.... then I had a sip.... which turned into a five day bender.  I’m an alcoholic. It’s been 3 days (insomnia again). And wanted to hit up a meeting when I got back home. But if they are going to push God on me, I’m not going and I’m just going to post on r/stopdrinking everyday or something. I just don’t believe that. And that isn’t alcohol related. I’m not here to argue atheism with anyone and I wouldn’t do that in a meeting I’m not an evangelical atheist. I’m just asking how y’all handle those steps and alcoholic atheists. ", 
      "subreddit": "alcoholicsanonymous", 
      "title": "So I wanted to go a meeting, but I’m an atheist. Is that a problem with the whole steps thing?"
   }, 
   {
      "selftext": "I just got back from vacation with my husband and am overwhelmed with how much my life has changed since I got sober. \nWhen I came into sobriety, I was 28 years old with a great job, nice things, and a marriage. I thought I was holding things together but I was actively dying from alcoholism. Every time I would travel for work, I would end up in the hospital with a lethal amount of alcohol in my system. My husband was getting ready to leave me and I was missing meetings for work. I was drinking from the time I woke up in the morning to when I would pass out, wake up, and do it all over. I was on conference calls and in meetings drunk. \nMy husband was getting ready to leave me when I got sober and I knew my job would follow. Then I would lose my housing, money to support myself, and anything else I held of any value. I was lucky to not be a low bottom drunk but I was and am absolutely eligible for it. \nI got sober through intensive outpatient rehab and AA. I had to be brutally honest with myself and willing to do anything to get and stay sober. I had to be honest with my employer about my drinking problem and take disability to get sober and enter treatment. \nToday, life is more full than I ever could have imagined. I still have my job and was able to get through a large reorganization of the company and move across the country with my husband and stay sober. My marriage is better than it’s ever been and while my husband is not an alcoholic, he says that me getting sober is the thing he’s most proud of. \nIf you’re just starting out or struggling, there is NO problem a drink won’t look at, laugh, and say “oh let me show you something that is actually fucked up”. \nThank you for being here for me and our collective sobriety. IWNDWYT! ", 
      "subreddit": "stopdrinking", 
      "title": "555 days of freedom"
   }, 
   {
      "selftext": "In the past 8 years this is the longest time I've not drunken consecutively. The past 2 years I've tried to quit for a month to see if I could do it, I always went out. I've been cutting back on alcohol in the past 6 months or so but my relationship with alcohol is still unhealthy. I drink to get drunk or blackout. Circumstances in my life led me to AA in this past month, and even though I am not religious I really enjoy going to meetings so far. \n\nIm only 25, my drinking began in college as normal drinking with everyone else but after graduation I was just sent off to the world as a functional alcoholic. Through AA I've done a lot of thinking back of my habits and self reflection and accept I'm an alcoholic. I'm just ranting now.... I just feel so great being sober and happy with how I've felt emotionally in the past month. I can't wait for my 60 day chip. ", 
      "subreddit": "stopdrinking", 
      "title": "31 Days!"
   }, 
   {
      "selftext": "Hi, r/stopdrinking. \n\nI've recently learned the extreme extent to which my mother was abused as a child. The worst kinds of things imaginable. Because of this, she suffers from BPD, DID, PTSD, and depression. I didn't know until recently that she is also an alcoholic. She hid it from my siblings and me, and now that we are out of the house some things came to light. I don't think she has admitted to herself that she is an alcoholic, or if she just won't admit it to us. She can go days without drinking, but then the next day a 26er \\(750 ml\\) of hard alcohol will be gone. She has some incredibly destructive and abusive habits when she's drinking, and it's really rough on my father. It also mixes badly with her medication, and I\"m constantly worried about her to the point of having nightmares. I wouldn't be surprised if she drank herself to death, and soon.\n\nIt's made me question my own relationship with alcohol, and see the much, much, more sinister side of it. I'm not a heavy drinker\\- don't really drink throughout the week, but I can binge pretty hard on the weekend, and have a few hangovers a month. I've cut down on drinking, and I'm doing \\(trying to do\\) my first ever sober month. I've tried before, but it doesn't seem to stick. I'm really bad at giving in to peer pressure, and the FOMO is real. I think as soon as I tell myself I'm doing a sober month, something inside me resists and I drink sooner than I would if I wasn't \"doing a month.\" \n\nI'm not sure what I'm looking for. I guess it's just good to know there's a community here. I can't talk to many people about it, \\(hence throwaway account\\) because I don't want to betray all of my mother's struggles, and at the heart of it, that's why I'm doing it. Any thoughts or words of wisdom are appreciated. ", 
      "subreddit": "stopdrinking", 
      "title": "Newbie with alcoholic mother."
   }, 
   {
      "selftext": "11/15/2016: That day I was finally licked. In AA, they talk about a point where one can no longer live with or without alcohol, and I had forgotten from years before what that looked like. I had been sober for nearly two years before, and yet I left my personal health unchecked. Resentments over breakups, feeling cut out of my normal circles, and neglecting to walk the walk that i was talking led me out the door, to stay out for eight long months. In that time, I was shown through my drinking that it wasn't long before I was back to the point before I was first introduced to the program. I'm also diagnosed Bipolar II, and during the whole time sober and out the last go around, i left it unmedicated with no real structure to stick to. That alone is a nightmare to deal with, even before i introduce alcohol. \n\nOne of the worst feelings in the world in my experience is a manic episode left unchecked. That first week of being sober again was agony. I had hit about five days dry when that manic episode hit. My mind raced so quickly of thoughts and feelings of pure misery, I wanted nothing more than to just stop the thinking for good. I was prepared for it too. I was going to to to my local late night meeting, set up a noose, and hang myself when I got home. I sat through that meeting for a good half hour mulling over final preparations, until it hit me: I have something wrong with me that AA alone can't fix, and that i needed help. Luckily I had reached out to a friend that was at that meeting with me and explained to him that I needed to go get some psychiatric care. I actually had the chamce to thank him the other day, and that was tear jerking for me.\n\nIt was there i got some more of the proper treatment that i needed. I was given medication to help with the mood swings, and I was well off until I decided that I didn't need meds anymore. I had stopped in February of 2017 and went along like i was fine. That worked until it didn't. In the next 12 month's that followed, I had made more calls to the National Suicide Hotline than I cared to admit. I had to face again that I am still in need of medication and help from professionals to be better in general.\n\nI recently celebrated my 27th birthday at the end of last month, and it was then I decided to really get serious about my mental health. For someone like me, my mental health and my sobriety will always work in tandem. One doesn't supersede the other. I cannot have one without the other. Its a scary experience for sure, but I can't wait to see what's on the other side of this. I apologize if I rambled a little. Its just something that was on my mind. ", 
      "subreddit": "stopdrinking", 
      "title": "555 days... The journey with dual diagnosis and recovery"
   }, 
   {
      "selftext": "I'm guessing this is a common experience, looking to see if anybody has some wisdom on this topic. I find I only think about alcohol when a drink is basically placed in front of me or if I'm on SD, at AA, or reading a book about recovery, and thinking about drinking is stressful, I feel like I'm focusing on the past or parts of me that are weak instead of the future and parts of me that I'm working to grow strong. I was powerless to alcohol, and I feel like now I'm not, if I were, wouldn't I be drinking? I haven't had an urge to drink basically since about two weeks in. I have a lot of other self-work to be doing (managing depression &amp; anxiety) but even on my bad days, going to get a drink doesn't even seem to cross my mind. When I walk past the liquor store, am in a a bar with friends, etc it just feels like seeing an ex at a party and I'm like \"glad I'm done with her, jeez, what a monster she was\". I know there will likely be something anywhere between 1 and 3000 days from now where I suddenly want to drink again, and I want to prepare for it. Sobriety has been such a gift so far.\n\nI keep going to AA meetings because people speak so highly of them and because they conjure this fear in me and I figure that's good to conquer, I'm not particularly good at sharing my feelings. I don't really have any problem with the program, I just feel like I'm engaging with an older version of myself which kinda floods those feelings and memories back if that makes a sense. Like I'll be doing all this positive self-work and then on Wednesday when I go to the meeting, I feel like my old self. I like new, sober, positive me. My rational side says this desire to stop working AA is just the alcohol being insidious, but it feels much more like a calm decision instead of the erratic or frenzied ones alcohol usually pushes me to make.\n\nHave you had a similar experience? Did you end up not going to meetings or cutting some sobriety-related things out of your mental space so you could make room for your other priorities? How did that work?\n\nThanks for reading and responding, you all are the best &lt;3", 
      "subreddit": "stopdrinking", 
      "title": "Focusing on sobriety too much?"
   }
]