[
   {
      "selftext": "\"Simplicity,  devotion, steadfastness, and loyalty; these, we remembered, were the  hallmarks of character which Dr. Bob had well implanted in so many of  us.\"\n\nAA Co\\-Founder, Bill W., September 1950 \"We Came of Age,\" The Language of the Heart\n\n[http://www.aagrapevine.org/grapevine\\-daily\\-quote\\-may\\-24\\-2018](http://www.aagrapevine.org/grapevine-daily-quote-may-24-2018)", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 24"
   }, 
   {
      "selftext": "\"In  AA we aim not only for sobriety \\- we try again to become citizens of  the world that we rejected, and of the world that once rejected us.\"\n\nAA Co\\-Founder, Bill W., as quoted in April 1998, \"Citizens of the World\", AA Grapevine", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 19"
   }, 
   {
      "selftext": "\"Whatever strengthens the spirituality of the group strengthens my spirituality, and vice versa.\"\n\n\"Tradition Five: What a Group 'Ought' to Be,\" May 2006 AA Grapevine\n\n[Grapevine Daily Quote May 29](http://www.aagrapevine.org/grapevine-daily-quote-may-29-2018)", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 29"
   }, 
   {
      "selftext": "\"We shall never be at our best except when we hew only to the primary spiritual aim of AA. That of carrying its message to the alcoholic who still suffers alcoholism.\"\n\nAA Co-Founder, Bill W., April 1948 \"Tradition Five\", The Language of the Heart", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 4"
   }, 
   {
      "selftext": "\"Truly transforming spiritual experiences are nearly always founded on calamity and collapse.\"\n\nAA Co\\-Founder, Bill W., August 1957, \"The Physicians\" The Language of the Heart\n\n[Grapevine Daily Auote May 30](http://www.aagrapevine.org/grapevine-daily-quote-may-30-2018)", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 30"
   }, 
   {
      "selftext": "\"In  the Twelve Steps, AA offers not a theory, not a hypothesis, not a pious  hope, not \\-\\- thank God \\-\\- wistful or wishful thinking, but an  historical record of how more than 25,000 \\[now over 2,000,000\\]  alcoholics achieved sobriety.\"\n\n\"A Way of Life,\" Chicago, Illinois, July 1946, AA Grapevine\n\n[Grapevine Daily Quote May 27](http://www.aagrapevine.org/grapevine-daily-quote-may-27-2018)", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 27"
   }, 
   {
      "selftext": "I’ve always liked the occasional drink. One or two here and there was enough. Then I was hit with a massive personal tragedy. My pregnant wife passed away suddenly and unexpectedly four and a half years ago. I was left with a young child, on my own and needed to cope. I gave myself six months of as much of whatever I needed. I drank. I smoked. I smoked weed. Six months flew passed. I kept on doing what I was doing. “I can stop any time I like.” \n\nFour and a half years later, I’m off the cigarettes and the weed for a year and a half now. The booze though. It turned into day drinking. A whiskey at 8am was no problem. I was up to two or three bottles of spirits, two or three bottles of wine and a dozen or so beers a week. \n\nI didn’t see this as a problem. I didn’t get drunk and fall over. No hangovers. No vomiting. (Ok maybe once or twice.)\n\nI’m remarried now. And have a new baby. We’re a family gain. Yet drink rules my life. NO. I’m done. It has made me into a liar. A secret drinker. Angry. Unproductive. I can’t sleep. My new marriage is rocky. It’s all my fault. It’s the bottles. \n\nI’m done. I’m done. I’m done. \n\nI lay in bed last night after several drinks. My kidneys ached. The headache. The depression. The self hate. The disappointment. \n\nI’m an alcoholic. But I will NOT drink with you today. ", 
      "subreddit": "stopdrinking", 
      "title": "I drank to get over a tragedy, and couldn’t stop, until today"
   }, 
   {
      "selftext": "\"When we consult an AA friend, we should not be reluctant to remind him of our need for full privacy. Intimate communication is normally so free and easy among us that an AA adviser may sometimes forget when we expect him to remain silent. The protective sanctity of this most healing of human relations ought never be violated.\"\n\nAA Co-Founder, Bill W., August 1961 \"This Matter of Honesty,\" The Language of the Heart", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote April 25"
   }, 
   {
      "selftext": "\"When I'm in fear, my sponsor always tells me, 'Maybe you should get a bigger God.'\"\n\n\"A Bigger God,\" Los Angeles, Calif., March 2002 Beginners' Book: Getting and Staying Sober\n\n[http://www.aagrapevine.org/grapevine\\-daily\\-quote\\-may\\-23\\-2018](http://www.aagrapevine.org/grapevine-daily-quote-may-23-2018)", 
      "subreddit": "alcoholism", 
      "title": "Grapevine Daily Quote May 23"
   }, 
   {
      "selftext": "I understand what an alcoholic is. And I never really drank much. Went years without having a drink except for weddings and or an occasional night out. BUT now I'm drinking regularly. I am in my 40s and last year my mother was diagnosed with cancer. So between traveling back and forth to her and trying to spend time with my husband, the alcohol became a nice wind down and let loose once a week. My husband would smoke a joint and I would drink 6 pack of wine coolers while sitting out back during the summer. Then I decided that the wine coolers weren't that high in alcohol content and just sugar! So I switched to a bottle of red wine. Then I started drinking earlier on Saturdays, my drinking time became 4PM instead of 8 or nine, and because of that I needed 2 bottles of wine. Now I find myself wanting it all the time and 4 pm is now 3 pm. And today is the first time I'm drinking on a work night! Tomorrow is a big event at work and I've been on vacation all week. I've been letting loose every other day. And here I am polishing off a bottle and a half of wine, my reasoning is, it's still earlier, I can feel fine in the morning. I think overall it has to do with the sugars and not just the alcohol... but still. I want to add... I've never felt guilty about drinking. I have always been able to do whatever I needed to the next day. I don't cancel plans. I know in my mind what an alcoholic is...\n\nBut I still wonder... am I becoming one?", 
      "subreddit": "alcoholism", 
      "title": "So unsure if this is alcoholism."
   }
]