[
   {
      "selftext": "Hey r/stopdrinking! I apologize ahead of time if this seems like some text vomit here...\n\nSo, I’m looking for some advice/input from all of you lovely people in regards to my situation.\n\nA little background here. I have been sober since 7/25/17 and have gotten sober through AA. Had a sponsor, followed directions as they were given, worked the 12 steps. After doing 90+ meetings in 90 days, I was going to 4-5 meetings a week.\n\nNow, life has picked up. I have a (non-alcoholic) partner, I graduate cosmetology school next month, I test for my cosmetology license and begin working full time in July... basically life is getting busy. I’m finding that as I approach a year of sobriety, I have become much less dependent on AA. I KNOW that I simply cannot drink because I can not control my drinking, drinking does not make bad situations good, or good situations better, yada yada. I have no desire to drink or fix my problems with drinking. I also see a therapist weekly where I discuss my addiction recovery. \n\nMy question to you all... I feel like I can only extend myself in so many directions. My sponsor has told me that if I cannot attend at least 3-4 meetings every week, that she will not sponsor me. Would taking a step back from the program (NOT my sobriety, just the program of AA) be a huge misstep? Have you been successful staying sober without a structured program such as AA? I would really appreciate any feedback or suggestions from all of you lovely people. \n\nThanks in advance! ", 
      "subreddit": "stopdrinking", 
      "title": "Taking a break from a structured recovery program?"
   }, 
   {
      "selftext": "Hello. I have been working with the addiction counselors, worker, and therapist for 6-10 months now for childhood trauma, autism, and alcoholism. Me and my worker have worked very well together, he has been incredibly helpful. This morning I cleaned this whole place, started laundry, ate something, and put dinner into the crock pot, not a meaningless thing for me. But I am supposed to do the school work towards the last two credits of highschool. Oh, I will do it. But there is four months until it needs to be in in mid September in time for graduation on October. And I just cannot get the motivation. It will get done, but it is awful, I am thirty seven, and it is as awful as when I was in school the first time. Just enough work to be vaguely difficult, teaches nothing I did not already know though, and does not get into enough depth to either be interesting or actually teach something meaningful.\n\nBut my social worker is coming in a couple hours. And he is changing his tack, according to him last Friday during our last session. He says he is going to \"be pushing me\", and that we \"need to put our foot on the gas\" during our last two months of the year long program I am in. I was in a bit of a depressive state until he pulled me out of it after about a half an hour into our last session.\n\nBut he told me that it is hard, that it is difficult for him to deal with my depressive states. Now if we are friends, as he has repeatedly said we are, that makes sense to tell me. But I still question if we are, he does not visit socially, a big part of friendship in my view, kinda the core of it. But if he is not my friend, he was just being nice, then how is that helpful for me to hear?. Oh, it only makes sense he feels it. But look at that reaction, and figure out how to use it or something. Because being told it only cements my feelings of myself as a burden.\n\nAs well as the whole foot to the gas, pushing me thing. Something about it rubbed me wrong. This is, or was, a collaborative, client driven process. I would like to have been asked about my feelings as to my ability, and my comfort level being pushed. And whether I wanted to put the foot on the gas. Because I do not. I am making progress continuously, and I am pretty happy with my rate of recovery. If we went a little faster I would be fine. But much faster and it would hit a wall. And I honestly don't want to go faster, I am happy at this speed.\n\nBut he has been great, just wonderful. He is keeping all my belongings that I cannot fit in this little apartment in his private storage locker. He got me this apartment, and this computer. Introduced me to people and helped me find resources. And he is a kind person. But this is unsustainable. If he starts pressing me when I do not feel up to it, it got some stuff done today. But longer term it will make me angry and resistant as all hell. But I want to work with him, not frustrate him. So I am not sure. This is a bit of a vent, he is here in two hours, but it is a larger issue of him becoming somewhat insistent, scolding and blamey when I do not accomplish something he wants me to, nice though he is. Any advice would be helpful. Thanks to anyone reading this. I hope your day is great.", 
      "subreddit": "survivorsofabuse", 
      "title": "Issue of motivation. Question about social worker and goals."
   }, 
   {
      "selftext": "I quit drinking over 4 years ago, and in general have been doing very well since then despite a few small hiccups. When I first confessed I was an alcoholic to my boyfriend, he stopped drinking at home as well for at least two years, but he would still drink occasionally if we went out, or went to a party, etc., and very rarely to excess. I actually never asked him to do that ... he did it entirely on his own, and I consider him to be an extremely supportive person in general, aside from that\n\nAfter about two years of sobriety, I told him it was OK if he drank at home occasionally, because I didn't want my alcoholism to stand in the way of his freedom, especially now that I felt stronger.  At the same time, I believe I also mentioned that I would speak up if his drinking ever began to bother me, or if I had concerns, etc.\n\nWhich, of course, is what brings us to now. While his drinking is not extreme, it has become habitual (which I define as at least 2 drinks every day for the past 2+ weeks).  From my own experience with alcoholism, I believe the disease is very subtle in that it often takes years (or decades) to progress to the point where the individual's behavior begins to cross the line from \"socially acceptable\" into problematic. This can make identifying addiction problems in their early stages difficult. \n\nI plan on having a discussion with him tonight about all my concerns, but it's helpful (and cathartic) for me to get these feelings out in writing as well, which is probably the main reason for me posting. For instance, when I think of my own drinking, I am not sure what - if anything - would have gotten me to stop until I reached my own rock bottom. When I was simply habitually drinking, nothing would have gotten me to stop, so in some ways I feel like the disease needs to run its course until the alcoholic discovers what is really going on, and comes to some sort of epiphany.\n\nBut that was my own experience, and I'm not sure if everyone has the chance to come to that epiphany. And aside from that, and because his drinking is not yet extreme, I also wonder if I am somehow projecting my own disease onto him and seeing problematic behavior where it doesn't exist. \n\nHas anyone else been in a situation like this? How did it progress over time and how did you handle it? I sometimes feel like I am on \"the other side\" after entering recovery and am unable to see these issues clearly. On the other hand, maybe I am actually seeing everything incredibly clearly and I just need to be prepared. ", 
      "subreddit": "AlAnon", 
      "title": "I've been in recovery for 4+ years, now worried about my long-term boyfriend"
   }, 
   {
      "selftext": "Hi,\n\nI would like your advice.\n\nAlcoholism runs in my maternal family. My uncle fucked up his life because of the alcohol, and maybe my grandmother, mother and other uncle are alcoholic. (Right now I'm dating a \"recovered\" alcoholic.)\n\nI had my first beer (accidentally) at 9 years old. I didn't drink again until I was 19 or something like that. Right now I am 24.\n\nI've always been afraid of alcohol, of drunk people and of getting drunk. There are countless reasons for this. But I've always known that I COULD be an alcoholic because of my genes.\n\nI've become quite fond of beer and like pretty much any alcohol, except vodka. However, I only drink in very controlled environments: alone, with my mother, or with my boyfriend.\nIn the last five years or so, I've built up my tolerance to the point where I can happily drink 6 common beers, 6 shots of brandy, 2 glasses of wine, and still be fine. (I weigh about 49 kilograms, or 108 pounds and I am a female) Beers are like water for me now, but I avoid drinking with coworkers or strangers in general because I'm afraid they'll judge the amount. \nI like beer (and the other alcohols) because of the taste. I am quite selective and try to become an expert in beer. I do not drink for the sake of the effects of alcohol, which I do not experience and do not wish to. At most, I'll feel dizzy and I'll stop. But that doesn't really happen anymore. Also, I drink a lot of water while I'm consuming alcohol.\n\nIn a week, I drink two to four days. Usually it's anything between a normal beer to six beers per day. So there are weeks when I consume 2, and weeks when I drink about 24 beers. Normally it's about 6 beers per week. \n\nI do not feel anxious if I cannot drink, and I have a lot of chronic health issues going on, but my first question is to the doctors is: \"Can I still drink while I'm on this medicine?\" Beer is the only thing I actually WISH to ingest; for some reason I've lost interest in food. I eat, but I'd rather drink. I can afford my consumption. I have always been a responsible student and employee. But a doctor said that, because of the amount of alcohol I drink per week, I qualify as an alcoholic.\n\nIs this possible?\nAm I an alcoholic in denial?\nDo I need help?\n\nSorry for the length and thank you.\n", 
      "subreddit": "alcoholism", 
      "title": "Doctors say I'm alcoholic, but I've never been drunk. Can this be possible?"
   }, 
   {
      "selftext": "I hope I don't get too rambling and long, I'll try and keep it short enough. I just want to get my story off my chest and let go so I can move forward. I want to forgive myself and I'm feeling so much shame and embarrassment right now.  \n  \nI have been drinking all of my adult life. I started at around 15 with my boyfriend who could get alcohol from his older friends. We drank on and off socially and on weekends together. I eventually graduated and moved to college, rooming in the dorm with my best friend. I chose what college I went to based on the fact that the boyfriend (a year older than me) had gone there. Best friend and I had a difficult time making friends and therefore stayed in our room and drank constantly. Thus began my foray into serious alcoholism. I missed a number of classes and was getting even more depressed than I had been. I had a number of issues, including some sexual abuse from a boyfriend at 14. I had turned all my hate inward and was self harming pretty frequently.  \n  \nSix months into college I overdosed on Tylenol and went to bed. The next morning I was vomiting what felt like pure acid. I called my parents who asked my roommate to take me to the hospital. I was in the ED and the nurse who took care of me was condescending and even after giving me the antidote nonchalantly said \"Well, you could still die from this.\" I was hospitalized overnight and my parents came and took me the 2 hours back home. I withdrew from school. I never was hospitalized inpatient for my suicide attempt.  \n  \nWhen I got back home I spent the next few years doing just over minimum wage jobs and feeling sorry for myself. Depression was at a critical level and I contemplated suicide a lot. I gained a ridiculous amount of weight and ended up over 300 pounds. At 5'5 I felt like an elephant. I hid my alcoholism from everyone. Drank in my room alone.  \n  \nDuring this time I met some people on Craiglist, met a number of guys online. I was manipulative and a terrible person for a while. I broke a number of hearts and had my heart broken a number of times. All of it boiled down to my self hatred. I took it out on everyone else, especially when I was drunk.  \n  \nEventually, I realized I had to do something about my weight. I had not been able to be compliant with a diet and my parents were supportive so I got a weight loss surgery. As I started to lose weight, I gained confidence. But what I didn't realize is that because of the smaller stomach, alcohol now hit me faster and harder. I spent a decent time sober, met a guy who was great, and lost a bunch of weight. Until I decided I was ok to drink again.  \n  \nThe next few years were marred with alcoholism. The guy stayed with me and supported me through it all. All the nights that I drank so much that I puked and then drank more. When I quit my job in a hangover panic. When I came home from work sobbing every day because of depression and anxiety and then turned to the booze again. I became a verbally abuse drunk. I have always been empathetic, which was great when sober because I could really help people, but terrible while drunk because I could really dig hard at people. I have always known what buttons to push and for some reason I am very articulate when drunk. I also blacked out constantly. I'd have no memory of how bad I treated people.  \n  \nI ended up getting sober for a year. I was sick and tired of it all. I thought I was at rock bottom. He and I moved away from my hometown, I got a new job I enjoyed and things were great. But we were not great. In this time we had grown apart, or I had grown apart. We became more like roommates than lovers. Best friends but not in love. At least, I wasn't in love. I started drinking again.  \n  \nI met another man, who I had known for a long time. I regret this to this day, but we had an affair. I never told my guy, but I left him because I didn't think it was right and I felt such tremendous guilt. He was such a good man and I was so wrong. I started drinking very heavily again after leaving due to the guilt and shame.  \n  \nI have hit rock bottom now. I am still with the man I had an affair with and he is a wonderful guy too. Supports me through everything. Lets me live with him. Forgives me for black out making drunk decisions that are awful. I spiraled to the point where I drove drunk, something I promised myself I'd never do. I bought little wine bottles and would drink them when I got 5 minutes from the house so that I could hide my drinking. He knew me enough to realize.  \n  \nOver the weekend I embarrassed myself in front of his family and his sister's family. I then proceeded to get mad at myself, sit in the bedroom and punch my legs. I woke up hungover, painful and depressed. I have little money due to compulsively shopping while drunk. Am in a stupid amount of debt at the moment. But I started sober yesterday.  \n  \nThis got way too long, but the point of it is, I am not that person anymore. I am my sober self. I have done it before and I can do it again. I have been hiding in my room due to shame (We live with his family atm because I need to pay off debt and save money). He spent all day yesterday with me making sure I was ok. He watched over me while I slept last night because I was having bad dreams. I told him to tell his family about my alcoholism and to apologize for me. He did and said they seem ok with it. They are not very formal and conservative as my family.  \n  \nI'm still ashamed. Not sure if I'm leaving the bedroom today. But I am sober. I have a job where I can eventually pay off my debt. I have a guy that I adore and that loves me enough to help me get through this. I will not ruin it this time. I will not hurt anyone else. I will not hurt myself. I will get through this journey to self love and forever sobriety. I am myself today.  \n  \nIWNDWYT  \n  \nIf you made it through my story, thank you. I appreciate the listening ear and shoulder to lean on.  ", 
      "subreddit": "stopdrinking", 
      "title": "Day two: Didn't ever think I'd have to start this again"
   }, 
   {
      "selftext": "Hi!\n\nSo some backstory: I quit drinking one month ago (30 days sober as of today). I would say that I was a functioning alcoholic. I mean that in the way that I wouldn't drink every day or get black out drunk. But I did drink about 4/5 days a week, mostly wine and beer, and when I drank I couldn't stop at just one glass of wine or one beer. I would also often drink alone. So I am aware that I am not one of those people who can drink occasionally a glass of wine. When I drank I always craved more. So I quit drinking a month ago, haven't had any withdrawal symptoms, but I do crave alcohol from time to time. \n Also about a month ago I met a new guy, and we have been on several dates so far, and talked about being exclusive and both wanting a serious relationship. I wouldn't say I am in love with him, but I do like him a lot and look forward to what may come out of it. The problem is I knew his mother died 3 years ago (he is 30, I am 29), but recently he told me that she died of alcoholism. She had been an alcoholic his whole life and because of it during part of his childhood he lived with his grandmother. She also had been in and out rehab, tried to quit several times, etc. the whole story. Moreover, he never met his father, so despite all this, his relationship with his mother was quite close.\nSo, since I have just met him and I didn't want to scare him away, I haven't told him yet about my problems with alcohol. Now I am even more afraid that knowing my struggle with alcoholism will scare him away, but at the same time I feel that it is unfair to keep it a secret from him, given his past. I feel like I should tell him, because I feel like, given his mother's story, we would not want to get involved with someone like me. \n\nSo my question is: what would you do if you were in my place? Would you tell him right away in case he didn't want to pursue a relationship with someone like me? or would you wait to see how things go?\n\ntldr; I quit drinking a month ago, my new boyfriend (been dating for one month) just told me his mother died of alcoholism. Have not told him yet about my struggle with alcohol. Not sure if I should tell him now or wait.", 
      "subreddit": "stopdrinking", 
      "title": "New boyfriend's mother died of alcoholism."
   }, 
   {
      "selftext": "This is my first time here though I should have come a long time ago. This will be a long post with a lot of backstory so I apologize in advance. My mom and I were extremely close growing up and she was nothing but loving and supportive to me. Two years ago, things took a turn for the worst. I wasn't aware until recently, but apparently she has been addicted to pain meds for pretty much my entire life- she sustained a near-death accident when she was 18, and has had numerous surgeries since then. As such, she was always heavily prescribed meds and became addicted. My dad and her would fight about this frequently (never to my knowledge, I rarely if ever saw them actually have any serious verbal fight, and they have certainly NEVER had any physical fight). Anyways, my moms doctors stopped prescribing her pain meds at some point along the line- and she switched to alcohol. She never drank heavily but definitely always liked beer and would drink more than most other parents- but never liquor. She switched to liquor and began drinking in private, hiding bottles in our house, etc. It got very bad very quickly, but we (my dad, brother, and I) had no idea as we had never encountered real alcoholism. She passed out on the floor when my girlfriend (now-fiancee) came over for dinner one day. This was the first sign of a real problem. This was on a Sunday, and I was so embarassed that I left the house (I was living at home at the time). I went to work the next day, and came home and went straight to my room. My mom came home from work and wanted to talk acting like nothing was wrong. I was still furious with her and said \"I'm not talking to you until you apologzie for embarassing me and until we sit down and have a talk with Dad.\" She tries to change the subject and I ignore her. She sulks upstairs (drunkenly, though I didn't admit it/notice at the time). About 30 minutes late y dad rushes into my room asking what the fuck happened to my mother. Apparently, he came home to her sitting on our staircase, swaying violently, blind stupid drunk, drinking a 750mL Tito's bottle straight. She was crying and babbling about nothing and he put her in bed upstairs. She threw up violently and was just losing it. I'll never forget walking up those stairs to see her- the stairs she carried me up when I had a broken foot when I was younger. The stairs she chased me up when we were playing. The stairs she cried when she watched me walking down them for my first date/prom/graduation/moving out for college. The stairs that held so many fond memories were now a staircase to a hellish nightmare. I traversed the dark stairs, hearing her wails and sickness with each step. As I turned into her room, there was my mom, a soulless husk of the grand woman I have so much love and respect for. In short, she said she wanted and needed help. We took her to the ER where she got some benzos and we came home. She began an outpatient detox because she couldn't miss work. Started therapy sessions and going to AA. Things were going great for awhile- she would talk about her sobriety and celebrate milestone days (1 week, 1 month, 2 months). But she slowly stopped attending AA (said she didn't like the old people and depressing nature of it), stopped celebrating milestones, etc. She relapsed. Not as bad this time, just beer, but still relapsed and we had to find out by finding the bottles. Rinse repeat the cycle- less emotional this time, more anger on my part but not outward, still very understanding. Same cycle, did a physician-appointed at-home detox of sorts with my dads unwavering help and support. Weened her down. Things went well for longer than before- about 6ish months. Fast forward to 2 weeks ago. I am engaged to be married (September 15th). My mom had talked about this moment my entire life and LOVES my fiancee. Wedding planning has been difficult though. My mom will get emotional about things, and even angry/lash out at me over small things (she is NOT an angry person, always the sweetest, gentlest woman I've ever known). I lose patience with her- she will get mad at me for not telling her about certain things with the wedding, though I have definitely already shared with her these things. She becomes more forgetful- I ignore the signs and grow disdain for her. I share less and less with her and go home less and less (maybe subconsciously I know she is drinking again, but can't handle the heartbreak of the lies and to see her in that state). My dad and brother (both at home) say nothing to me. Finally, I go home one night to discuss wedding stuff with my parents. My mom does not look well and is being very loud/animated. She says \"why haven't you shown me the wedding registry I haven't seen that\" when I had sent her the link mere days before. We go on and more of this continues, and my dad angrily yells at me at one point that \"this wedding is getting out of fucking hand\", which is bizarre because he has nothing to do with the wedding, the bride's family is handling it all as is tradition here in the States. Anyways, my mom is clearly very drunk, looking back, but I deny the signs and just think shes being stupid and head home early. Lying in bed, I can't shake the feeling of how \"off\" everything felt- I had dreaded goin home in the first place, and wanted to leave as soon as I got there. My house used to be a place of comfort- my friends would all come there and chat with my parents for hours. They'd come in times of happiness and sadness, because they loved my parents and parents were both so honest and welcoming and happy. We were never the richest and had financial problems, but our bond as a family was always strong. Lying in bed, I was overcome at how that feeling had gone completely to shit. I was overcome with how the happy memories of my mom were quickly fading and were being replaced with anger and resentment. My dad called the next day to apologize for his outburst. I said don't sweat it, hes stressed with work and whatnot, blah blah. But I gather up the courage to ask if mom is alright. Silence. He asks what I think. I say I think she's been acting increasingly irrationally, is forgetful, and that I think she's drinking again. He breaks down. She has been drinking liquor again at an increasingly alarming rate. In the morning, at work, on the way home in the car, and at home. Waking up in the night to drink. Lying to us. The car has damage from where she has hit curbs/backed up into things. She had made my dad and brother promise to not to me, as they are enablers and I am not. The last time this happened I had said if she drank again she would not be invited to my wedding (I realize this sort of ultimatum is probably not healthy but I honestly have no idea what the fuck I'm doing and am just lost and said what I fealt).They had got in a fight after I left because she was so happy I had come home to talk to them and said we had a great conversation- my dad said she had not pulled it off at all and he was embarrassed by her. My dad goes on and on about how she never wants to leave the house, and when they do she embarrasses him in front of their friends. He says \"I am fucking dying, son. I cannot keep doing this\". My dad has always been the light-hearted \"funny guy\" amongst our family and friends- to see him like this broke the little piece of my heart left that my mom hadn't already broken with her constant lies to my face about her problem. We talked for hours, I broke down in tears at my fiancees parents house. They now know her problem because I couldn't hide my emotions. Fast forward to today- my mom has underwent another successful \"weening\" detox and is 1 week sober (according to her and my dad). She is seeing her therapist again and, in my opinion, is sober and doing well. However, she is still hesitant to talk about alcoholism, and will not admit to friends that she has a problem. She also will not go to AA (she says its too depressing). I am extremely concerned with her having another relapse. I am concerned (selfishly) that my own mother will be too drunk at my wedding, and will embarrass me. I am concerned we won't have a mother-son dance. But most importantly, I'm just concerned for her. All my love for her is slowly leaving and getting placed with resentment- having her lie numerous times to my face to hide her drinking has ruined my trust with her. I question everything she tells me now, even in times of apparent well-being. What can I do? I have no friends who have been in a similar situation to seek guidance from. I just want my loving, sweet mother back, not this hellish shell of what she once was.", 
      "subreddit": "AlAnon", 
      "title": "My Wedding, my mother, and alcohol."
   }, 
   {
      "selftext": "Hello. I have been working with the addiction counselors, worker, and therapist for 6-10 months now for childhood trauma, autism, and alcoholism. Me and my worker have worked very well together, he has been incredibly helpful. This morning I cleaned this whole place, started laundry, ate something, and put dinner into the crock pot, not a meaningless thing for me. But I am supposed to do the school work towards the last two credits of highschool. Oh, I will do it. But there is four months until it needs to be in in mid September in time for graduation on October. And I just cannot get the motivation. It will get done, but it is awful, I am thirty seven, and it is as awful as when I was in school the first time. Just enough work to be vaguely difficult, teaches nothing I did not already know though, and does not get into enough depth to either be interesting or actually teach something meaningful. \n\nBut my social worker is coming in a couple hours. And he is changing his tack, according to him last Friday during our last session. He says he is going to \"be pushing me\", and that we \"need to put our foot on the gas\" during our last two months of the year long program I am in. I was in a bit of a depressive state until he pulled me out of it after about a half an hour into our last session. \n\nBut he told me that it is hard, that it is difficult for him to deal with my depressive states. Now if we are friends, as he has repeatedly said we are, that makes sense to tell me. But I still question if we are, he does not visit socially, a big part of friendship in my view, kinda the core of it. But if he is not my friend, he was just being nice, then how is that helpful for me to hear?. Oh, it only makes sense he feels it. But look at that reaction, and figure out how to use it or something. Because being told it only cements my feelings of myself as a burden. \n\nAs well as the whole foot to the gas, pushing me thing. Something about it rubbed me wrong. This is, or was, a collaborative, client driven process. I would like to have been asked about my feelings as to my ability, and my comfort level being pushed. And whether I wanted to put the foot on the gas. Because I do not. I am making progress continuously, and I am pretty happy with my rate of recovery. If we went a little faster I would be fine. But much faster and it would hit a wall. And I honestly don't want to go faster, I am happy at this speed. \n\nBut he has been great, just wonderful. He is keeping all my belongings that I cannot fit in this little apartment in his private storage locker. He got me this apartment, and this computer. Introduced me to people and helped me find resources. And he is a kind person. But this is unsustainable. If he starts pressing me when I do not feel up to it, it got some stuff done today. But longer term it will make me angry and resistant as all hell. But I want to work with him, not frustrate him. So I am not sure. This is a bit of a vent, he is here in two hours, but it is a larger issue of him becoming somewhat insistent, scolding and blamey when I do not accomplish something he wants me to, nice though he is. Any advice would be helpful. Thanks to anyone reading this. I hope your day is great.", 
      "subreddit": "BPD", 
      "title": "Issue with motivation, question about worker. and goals."
   }, 
   {
      "selftext": "Hello everybody, long-time lurker and first-time poster here. I recently reached one year (5/3 is my sobriety date) and have had an amazing experience working the program. Not only do I not drink, I actually am becoming a better person. When I first started this time around, I really took the first step 100% and accepted that I would never be able to control my drinking. So I'm committed to working this program for life, one day at a time. I chair a regular weekly meeting, I have a sponsor that I work the steps and do book study with, and I've got lots of phone numbers that I dial or sometimes dial me. Life's just plain better - not perfect by a long shot but much, much better. I no longer go to pieces as quickly when things don't go my way, and I'm learning to pause when agitated so I can do the next right thing.\n\nAnyway, my wife is a normie and while she is supportive of my sobriety and does a whole lot to help me, she's starting to feel that the program is taking more of my time than she would like. Most recently, I went to chair the Sunday meeting on Mother's Day and she was resentful that I didn't spend the day at home. I've explained that the disease doesn't take vacations, that this is good medicine for me, and that some time away from the house to do service work and get active in my group will pay dividends in the future. Thing is, when I was drinking I hid it so well from her that she doesn't really see a huge or obvious change in my behavior between me being drunk and me being sober. But I know inside that sobriety leaves me happier, more peaceful, and better equipped to handle life.\n\nSo, I've talked with my sponsor and some guys in my group. They all agree, from the alcoholic's point of view, that this can be a balancing act and some early tension in the marriage is normal, and that she will certainly like me better sober than drunk. And she agrees, logically, with the disease model and the idea that regular meetings are important maintenance. It's just starting to hurt her feelings that I spend some time away from home. But I have already cut down on meetings (I go twice a week instead of every day which was scary at first but has worked out well) and I really don't want to reduce them any further. I've tried white-knuckling things in the past and it absolutely sucked. So I know in my heart that meetings will be a part of my life and my routine.\n\nShe's not interested in Al-Anon, which is the most common suggestion I've heard, and I don't want to push it on her. I've brought home a couple pamphlets and suggested she maybe look at the \"For Wives\" chapter but she's not exactly enthusiastic to get a \"homework assignment.\" My therapist/counselor has offered to do a group session where she could explain recovery from a professional point of view but that's hard to coordinate with our work schedules. We are working out a schedule at home where my time away from the house is balanced by her getting an equal amount of personal time to go out, see friends, etc when I will be home taking care of chores and watching our kid. That's promising, but it's a very \"secular\" kind of solution that I think is only scratching the surface.\n\nAnybody got any advice, suggestions, or a similar experience I could learn from?\n\nThanks!", 
      "subreddit": "alcoholicsanonymous", 
      "title": "Sobriety and family time"
   }, 
   {
      "selftext": "I share my story in the hopes it will give someone the hope and strength they need to have the same experience I had to recover from alcoholism.  \nI was a nervous kid with lots of anxieties and adhd. I was off the walls and my head would never stop talking to me, I always seemed to overthink stuff. I never really felt like I was part of the group, like I was always on the outside looking in, even though I had friends.  I was never comfortable in my own skin. When I found booze I knew I found what was missing, looking back I was instantly addicted. I loved it, it made me feel like I could be the person I thought I wanted to be. I turned my life over to booze at the age of 13. Everything came second to booze. I chose a career where I could drink everyday working night shift as a waiter in restaurants. I had a shit tonne of fun and I was right in the middle of the action, I had arrived, I felt not only a part of, but almost like a leader of the party crew we had. Little did I know alcohol is a progressive disease and always gets worse, never better. My grandpa always said do something you love for a career, well I loved booze so I became a bartender... Lol.. (probably not what he meant) I ended up getting into cocaine which led me to my first treatment center. Funny thing is I wanted to quit coke so I could keep drinking, I never wanted to quit drinking, how could I ever have fun again without booze, life would be boring and mundane.... Shit was I wrong. Left that treatment center to drink the first night out. Then I moved towns and cocaine wasn't easy to find. I would come home after work and drink a 26er (750ml) of vodka by myself, pass out and wake up and puke a little bit..... Amazingly I actually thought I was doing good because I wasn't doing coke. My alcoholism progressed and I discovered the morning drink which was the death of me. I would drink the morning drink, trigger my allergy and keep drinking. In the end, after 20 yrs of hardcore drinking I had progressed to drinking around the clock, 4 or 5 day blackouts and I kept ending up on the hospital for medical detox as I was scared I would get seizures and die... It happens!.. Another treatment center only to drink the first day I got out again. In and out of AA for years, coming back over 30 times!... I was a hopeless alcoholic. I did want to drink but I couldn't imagine a life without it. How would I have the confidence to pick up women? To hang out with friends and be funny and the life of the party? How would I live life? I always had alcohol as a crutch to get me through the hard stuff in life.... Finally my family didn't want to talk to me anymore, not cus I was a bad drunk but they just couldn't stand by and watch me die, or come get their baby from the hospital shaking and on deaths door.... Again and again..... Finally my last drunk was a 4 day blackout, I knew I was going to die a lonely painful alcoholic death. I know to the core of my being that no matter what I do, I can not stop myself from picking up that first drink! I stood at the turning point, I was either going to commit suicide or completely turn my life over to a God I don't even think exists. I said to myself well if there is a God, I'm going to find out.... I got on my knees and I prayed, not like before but I honestly meant it and was willing to believe (there's no atheists when the plane is going down) I prayed to \"God\" and said I don't care what you would have me be, I completely give myself to you. You can have all of me and I meant it. I felt a weird feeling, like a 100 pound weight was taken from my shoulders. I was sick of following all the opinions and advice in AA, there is so much conflicting advice it's brutal. I said this time, I am doing it exactly how the first 100 men and women did it, if it isn't in the big book, I'm not doing it, nothing more, nothing less. It really worked back then, not now with all the treatment center bullshit. I studied that book like my life depended on it. I got a sponsor, I made a daily plan. Wake up, pray, make bed, red daily reflections, go to moon meeting, go to gym, read big nook, then night meeting, pray and go to bed. I did a meeting or 2 a day for the first year. I did my steps in the first 3 weeks, which is exactly how they are supposed to be done. I did them right out of the big book with the help of the Joe and Charlie speaker tapes... They are so amazing. They explain the book better than I've ever heard, I finally understood what to do... Today I am 9 yrs sober and I still call Joe and Charlie my program sponsors. I completely gave myself to AA even though I didn't believe in God and I hated AA and all those \"religious people\" and lame losers.... I found an amazing life. I made friends. I got involved with young people groups and we would go to dances and roundups, and bowling and kareoke and camping etc etc, I was the life of the sober party! I felt comfortable in my own skin! With the help of AA and \"God\" I walked through all those fears and lived life on life's terms and I thrived! ...... I started sponsoring people and they started getting sober. I ran Joe and Charlie step groups and helped others through the steps. I had a home group that I contributed to and ran the newcomers meeting for them before the main meeting. Today my life is honestly beyond my wildest dreams. When I sobered up I just wanted a little apartment and that would be great. I went back to school multiple times for different things, I learned how to be a mechanic and fix up jetskis and motorbikes, something I always wanted. I worked on boats and got other professional designations through school. I got jobs in top management for hospitality. Today I run my own successful business. I am happily married and have a dog and young daughter that makes me happier than I ever imagined I could be. I have a bunch of jetskis, boat, motorbike, etc. I own my own house on a large property. My life is amazing and I owe it all to AA...... If it weren't for AA I would be dead. I was a hopeless alcohol doomed to an alcoholic death but I was plucked from my own insanity by a power greater than me and have recovered from that seemingly hopeless state of mind and body.......i truly hope you all find your way. When. I tried to sober up without AA, sobriety was always something to endure, or fight through, and was very painful, with AA it made it so sobriety was something to be celebrated and enjoyed...  Here's a link to those tapes, pm me you email address if you want the sheets they talk about..... \nhttp://silkworth.net/pages/freestuff.php", 
      "subreddit": "alcoholicsanonymous", 
      "title": "hope for the hopeless"
   }
]